# 注释: 就是对代码的解释,方便程序员阅读代码,被注释的代码不执行.
# 1.注释的分类: 单行注释 , 多行注释
# 单行注释
# python2.x print "hello,world" 
# python3.x print("hello,world")
# notepad: ctrl + q  pycharm: ctrl + / 
# 快捷键 : ctrl + z 撤销  ctrl + y 反撤销
# print("hello,world")

# 多行注释 ''' """
'''
print("今天是python32期,python上课第一天")
print("总体学员人数,40人左右")
print("同学们上课积极踊跃,非常认真")
print("在半年之后,都要找一份满意的工作")
print("希望同学们养成吃苦耐劳的习惯,好好的学习python")
print("在未来,可以靠python大放光彩")
'''

"""
print("今天是python32期,python上课第一天")
print("总体学员人数,40人左右")
print("同学们上课积极踊跃,非常认真")
print("在半年之后,都要找一份满意的工作")
print("希望同学们养成吃苦耐劳的习惯,好好的学习python")
print("在未来,可以靠python大放光彩")
"""

# 2.多行注释的注意点
'''
如果里面嵌套的是三个单引号,外层使用三个双引号
如果里面嵌套的是三个双引号,外层使用三个单引号
单双引号要岔开
'''
'''
print("今天是python32期,python上课第一天")
print("总体学员人数,40人左右")
print("同学们上课积极踊跃,非常认真")
print("在半年之后,都要找一份满意的工作")
"""
print("希望同学们养成吃苦耐劳的习惯,好好的学习python")
"""
print("在未来,可以靠python大放光彩")
'''

"""
print("今天是python32期,python上课第一天")
print("总体学员人数,40人左右")
print("同学们上课积极踊跃,非常认真")
print("在半年之后,都要找一份满意的工作")
'''
print("希望同学们养成吃苦耐劳的习惯,好好的学习python")
'''
print("在未来,可以靠python大放光彩")
"""

# 3.注释具有一定的排错性
"""
先用注释包裹一份部分代码,查看是否报错
如果ok,缩小注释范围,再去一行一行进行排查,
直到找到错误为止,以此类推... 
"""

"""
print("今天是python32期,python上课第一天")
print("总体学员人数,40人左右")
print("同学们上课积极踊跃,非常认真")
"""
print("在半年之后,都要找一份满意的工作")

print("希望同学们养成吃苦耐劳的习惯,好好的学习python")

print("在未来,可以靠python大放光彩")


# 其他语言的注释形式(了解)
"""
/*  */ 多行注释
// 单行注释 
<!--  --> html注释
"""






