1.利用if语句写出猜大小的游戏：
	设定一个理想数字比如：66，
	让用户三次机会猜数字，如果比66大，则显示猜测的结果大了；
	如果比66小，则显示猜测的结果小了;
	只有等于66，显示猜测结果正确，退出循环。
	最多三次都没有猜测正确，退出循环，并显示‘都没猜对,继续努力’。
	
2.使用while和for 遍历字符串 "IG战队牛逼"
3.使用for循环对s="黄绿青蓝紫"进行循环，每次打印的内容是每个字符加上"色的"，	
  例如：黄色的 绿色的 青色的 ... 
4.完成要求：
用户可持续输入(while循环)
	输入A，则显示走大路回家，然后在让用户进一步选择：
		是选择公交车，还是步行？
		选择公交车，显示10分钟到家，并退出整个程序。
		选择步行，显示20分钟到家，并退出整个程序。
	输入B，
		则显示走小路回家，并退出整个程序。
	输入C，
		则显示绕道回家，然后在让用户进一步选择：
		是选择游戏厅玩会，还是网吧？
			选择游戏厅，则显示 ‘一个半小时到家，爸爸在家，拿棍等你。’并让其重新输入A，B,C选项。
			选择网吧，则显示‘两个小时到家，妈妈已做好了战斗准备。’并让其重新输入A，B,C选项。

5.写代码：计算 1 - 2 + 3 - 4 + ... + 99 中除了88以外所有数的总和？
6.(升级题)打印菱形小星星
     *
    ***
   *****
  *******
 *********
***********
***********
 *********
  *******
   *****
    ***
     *
























