1.99//4  ,  99%4 ,  -99 %4  ,  -99 %-4值是多少
2.成员和身份运算符如何使用
3.逻辑运算符优先级?逻辑短路在什么情况下发生?
4.优先级最高和最低的运算符是?
5.左移右移后的值如何计算?按位非的公式?
6.~(-25) ~25 推到一下过程
7.res = 17>15 or 78<11 or 7 and 8 and not True is True  res=?
8.计算表达式的值
    1).6 or 2 > 1      
    2).3 or 2 > 1      
    3).0 or 5 > 4      
    4).5 < 4 or 3          
    5).2 > 1 or 6      
    6).3 and 2 > 1     
    7).0 and 3 > 1    
    8).2 > 1 and 3    
    9).3 > 1 and 0    
    10).3 > 1 and 2 or 2 < 3 and 3 and 4 or 3 > 2
    11)not 2 > 1 and 3 < 4 or 4 > 5 and 2 > 1 and 9 > 8 or 7 < 6
9.提示用户输入 "如何在dnf中变得更强?". 如果输入的是充钱,打印"马化腾爱你" ,反之输出,"你想一想,不充钱怎么可能变得更强"